/*
// Задача 1. Напишите, программу, которая на вход принимает число и выдает его квадрат

int num;

Console.Write("Input a number: ");
num = Convert.ToInt32(Console.ReadLine());

int quad = num * num;

//Console.WriteLine("The square of " + num+ " is " + quad);

Console.WriteLine($"The square of {num} is {quad}");
*/

// Задача 2. Напишите программу, которая на вход принимает два чила и проверяет является ли первое число квадратом второго


